"""
学习目标：
    1.什么是文本预处理；
    2.文本预处理的作用；
    3.文本预处理包含的主要环节；

简介：
    1.文本预处理主要环节：
        1）文本处理的基本方法：
            s1：分词；
            s2：词性标注；
            s3：命名实体识别；
        2）文本张量表示方法：
            s1：ont-hot编码；
            s2：Word2vec；
            s3：Word Embedding；
        3）文本预料的数据分析：
            s1：标签数量分布；
            s2：句子长度分布；
            s3：词频统计与关键词词云；
        4）文本特征处理：
            s1：添加n-gram特征；
            s2：文本长度规范；
        5）数据增强：
            s1：回译数据增强法；
    2.文本处理中大多数是中文和英文，文本预处理也是围绕这两种语言展开；
    
"""